In [220]:
import numpy as np
import pandas as pd

# Series from List

In [221]:
#String
country=["india",'pakistan','usa','Srilanka','nepal']
pd.Series(country)

0       india
1    pakistan
2         usa
3    Srilanka
4       nepal
dtype: object

In [222]:
#integer
run_series=([23,4,3,2,33,443,2,3,3,2,2,3])
pd.Series(run)

0      23
1       4
2       3
3       2
4      33
5     443
6       2
7       3
8       3
9       2
10      2
11      3
dtype: int64

In [223]:
#Custom Index
marks=[23,43,43,56]
Subject=['maths','english','urdu','sanskrit']
pd.Series(marks,index=Subject)

maths       23
english     43
urdu        43
sanskrit    56
dtype: int64

In [224]:
#Setting a name
marks=pd.Series(marks,index=Subject,name="sujal ke Marks")
marks

maths       23
english     43
urdu        43
sanskrit    56
Name: sujal ke Marks, dtype: int64

# Series from Dictionary

In [225]:
marks={
    'maths':23,
    'english':43,
    'urdu':43,
    'sanskrit':56
}
marks_series=pd.Series(marks,name="sujal   ke  marks")
marks_series

maths       23
english     43
urdu        43
sanskrit    56
Name: sujal   ke  marks, dtype: int64

# Series Attributes

In [226]:
#size --> series me kitne items h
marks_series.size

4

In [227]:
#dtype--> datatype btata h 
marks_series.dtype

dtype('int64')

In [228]:
#name ---> List ka name bta deta h 
marks_series.name

'sujal   ke  marks'

In [229]:
#is_unique --> ye btata h ki aapke series ke sare item unique hai ya nahi
marks_series.is_unique
a=pd.Series([1,1,1,2,3,2,13,45432,422,4,32])
a.is_unique

False

In [230]:
#index
marks_series.index
run_series.index

In [231]:
#values
type(marks_series.values)

numpy.ndarray

# Series using Read_CSV

In [232]:
#with one col
subs=pd.read_csv("subs.csv")

In [233]:
vk=pd.read_csv("kohli_ipl.csv",index_col='match_no')
vk

          runs
match_no
1            1
2           23
3           13
4           12
5            1
...        ...
211          0
212         20
213         73
214         25
215          7

[215 rows x 1 columns]

In [234]:
# yha pe humne movie ko index banaya h 
bolly=pd.read_csv("bollywood.csv",index_col='movie')

In [235]:
#yha pe humne lead ko index banaya h 
pd.read_csv('bollywood.csv',index_col='lead')

                                                 movie
lead
Vicky Kaushal                 Uri: The Surgical Strike
Vicky Ahuja                              Battalion 609
Anupam Kher       The Accidental Prime Minister (film)
Emraan Hashmi                          Why Cheat India
Mona Ambegaonkar                       Evening Shadows
...                                                ...
Shah Rukh Khan                  Hum Tumhare Hain Sanam
Amitabh Bachchan                   Aankhen (2002 film)
Vivek Oberoi                           Saathiya (film)
Ajay Devgn                              Company (film)
Akshay Kumar                      Awara Paagal Deewana

[1500 rows x 1 columns]

# series Method

In [236]:
#head--> preview deta h start se 
print(subs.head(15)) # andar ye likhte h ki kitne chahiye
print(vk.head(11)) 
print(bolly.head(3))

    Subscribers gained
0                   48
1                   57
2                   40
3                   43
4                   44
5                   46
6                   33
7                   40
8                   44
9                   74
10                  49
11                  56
12                  49
13                  42
14                  39
          runs
match_no
1            1
2           23
3           13
4           12
5            1
6            9
7           34
8            0
9           21
10           3
11          10
                                               lead
movie
Uri: The Surgical Strike              Vicky Kaushal
Battalion 609                           Vicky Ahuja
The Accidental Prime Minister (film)    Anupam Kher

In [237]:
#tail --> preview deta h piche se 
vk.tail(5)

          runs
match_no
211          0
212         20
213         73
214         25
215          7

In [238]:
#sample--> Randomly koi bhi ek row nikalke dedeta h  
vk.sample(5) #kitni values cahiye
bolly.sample(4)

                                       lead
movie
Dream Girl (2019 film)   Ayushmann Khurrana
Jaane Kahan Se Aayi Hai     Priyanka Chopra
Beiimaan Love                   Sunny Leone
Yamla Pagla Deewana              Nafisa Ali

In [239]:
#value_count--> value ki frequency btata h 
bolly.value_counts()

lead
Akshay Kumar        48
Amitabh Bachchan    45
Ajay Devgn          38
Salman Khan         31
Sanjay Dutt         26
                    ..
Kashmira Shah        1
Kartik Elangovan     1
Karisma Kapoor       1
Karan Sharma         1
Zulfi Sayed          1
Name: count, Length: 566, dtype: int64

In [240]:
vk.sort_values(by='runs',ascending=False).head(5).values[0] #false karne
#se Descending me aagya

array([113])

In [241]:
'''yeh jo sort hai temporary changes karta h original 
wale me koi changes nahi karta matlab agar me ab apna 
 vk ko wapis print karau toh that is same''' 
vk

          runs
match_no
1            1
2           23
3           13
4           12
5            1
...        ...
211          0
212         20
213         73
214         25
215          7

[215 rows x 1 columns]

In [242]:
''' lekin me changes karna chahu toh kar skta hu by 
using "inplace=True'' se'''
vk.sort_values(by='runs',inplace=True)
vk
#now the values are sorted in original one

          runs
match_no
87           0
211          0
207          0
206          0
91           0
...        ...
164        100
120        100
123        108
126        109
128        113

[215 rows x 1 columns]

In [243]:
#sort_index-->inplace-->movies

bolly.sort_index()

                                        lead
movie
1920 (film)                 Rajniesh Duggall
1920: London                   Sharman Joshi
1920: The Evil Returns           Vicky Ahuja
1971 (2007 film)              Manoj Bajpayee
2 States (2014 film)            Arjun Kapoor
...                                      ...
Zindagi 50-50                    Veena Malik
Zindagi Na Milegi Dobara      Hrithik Roshan
Zindagi Tere Naam         Mithun Chakraborty
Zokkomon                     Darsheel Safary
Zor Lagaa Ke...Haiya!          Meghan Jadhav

[1500 rows x 1 columns]

In [244]:
#for permanent changes
bolly.sort_index(inplace=True)

In [245]:
bolly

                                        lead
movie
1920 (film)                 Rajniesh Duggall
1920: London                   Sharman Joshi
1920: The Evil Returns           Vicky Ahuja
1971 (2007 film)              Manoj Bajpayee
2 States (2014 film)            Arjun Kapoor
...                                      ...
Zindagi 50-50                    Veena Malik
Zindagi Na Milegi Dobara      Hrithik Roshan
Zindagi Tere Naam         Mithun Chakraborty
Zokkomon                     Darsheel Safary
Zor Lagaa Ke...Haiya!          Meghan Jadhav

[1500 rows x 1 columns]

# Series Maths method

In [246]:
#count--> total no. of item  (not count missimg values)
vk.count()

runs    215
dtype: int64

In [247]:
#sum--> Product
subs.sum()
subs.product()

Subscribers gained    0
dtype: int64

In [248]:
# mean/median/mode/std/variance
vk.mean()

runs    30.855814
dtype: float64

In [249]:
vk.mode() #jo value sabse jyada baar data me aati h 
bolly.mode()

           lead
0  Akshay Kumar

In [250]:
vk.median()

runs    24.0
dtype: float64

In [251]:
vk.std()

runs    26.229801
dtype: float64

In [252]:
vk.var()

runs    688.002478
dtype: float64

In [253]:
vk.min()
vk.max()

runs    113
dtype: int64

In [254]:
#describe
vk.describe()

             runs
count  215.000000
mean    30.855814
std     26.229801
min      0.000000
25%      9.000000
50%     24.000000
75%     48.000000
max    113.000000

# Series Indexing

In [255]:
#integer indexing
x=pd.Series([12,13,14,15,34,23,4,5,423,313,1131,3,4])
print(x[3])

15

In [264]:
#negative indexing
x.iloc[-1]  #kaam nhi karta "shayad string pe hi kaam karta h only"

np.int64(4)

In [260]:
vk.iloc[0]

runs    0
Name: 87, dtype: int64

In [274]:
#slicing
vk.iloc[5:16]

          runs
match_no
93           0
8            0
130          0
135          0
106          1
113          1
77           1
75           1
1            1
174          1
5            1

In [281]:
# negative slicing
vk[-5:]
bolly[-5:]
subs[-3:]

     Subscribers gained
362                 155
363                 144
364                 172

In [283]:
#fancy indexing ag
vk.iloc[[1,3,5,6]]

          runs
match_no
211          0
206          0
93           0
8            0

In [286]:
#indexing with labels
bolly.loc['Why Cheat India']

lead    Emraan Hashmi
Name: Why Cheat India, dtype: object

# Editing Series

In [291]:
## using indexing
marks_series[0]=100
marks_series

/var/folders/x6/3z1b_1m13nn8gl_5jykvtxy40000gn/T/ipykernel_2006/397763411.py:2: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  marks_series[0]=100

maths       100
english      43
urdu         43
sanskrit     56
Name: sujal   ke  marks, dtype: int64

In [294]:
marks_series['maths']=49
marks_series

## what if an index does not exist
marks_series['sst']=34
marks_series

maths       49
english     43
urdu        43
sanskrit    56
sst         34
Name: sujal   ke  marks, dtype: int64

In [308]:
#Slicing
marks_series[2:4]=[34,54]
marks_series

maths       49
english     43
urdu        34
sanskrit    54
sst         34
Name: sujal   ke  marks, dtype: int64

In [319]:

bolly.iloc[2:4,0]=["Raja ram","ma seeta"]
bolly # [2 se leke 4 aur then column ke liye zero]

                                        lead
movie
1920 (film)                 Rajniesh Duggall
1920: London                   Sharman Joshi
1920: The Evil Returns              Raja ram
1971 (2007 film)                    ma seeta
2 States (2014 film)            Arjun Kapoor
...                                      ...
Zindagi 50-50                    Veena Malik
Zindagi Na Milegi Dobara      Hrithik Roshan
Zindagi Tere Naam         Mithun Chakraborty
Zokkomon                     Darsheel Safary
Zor Lagaa Ke...Haiya!          Meghan Jadhav

[1500 rows x 1 columns]

In [321]:
#using index label
bolly.loc["1920: London"]=['sujal the Gangster']
bolly

                                        lead
movie
1920 (film)                 Rajniesh Duggall
1920: London              sujal the Gangster
1920: The Evil Returns              Raja ram
1971 (2007 film)                    ma seeta
2 States (2014 film)            Arjun Kapoor
...                                      ...
Zindagi 50-50                    Veena Malik
Zindagi Na Milegi Dobara      Hrithik Roshan
Zindagi Tere Naam         Mithun Chakraborty
Zokkomon                     Darsheel Safary
Zor Lagaa Ke...Haiya!          Meghan Jadhav

[1500 rows x 1 columns]

In [324]:
# Fancy indexing
vk[[0,2,4]]=[23,34,23]
vk

          runs   0   2   4
match_no
87           0  23  34  23
211          0  23  34  23
207          0  23  34  23
206          0  23  34  23
91           0  23  34  23
...        ...  ..  ..  ..
164        100  23  34  23
120        100  23  34  23
123        108  23  34  23
126        109  23  34  23
128        113  23  34  23

[215 rows x 4 columns]

# Series with python Functionalities

In [333]:
#len/type/dir/sorted/max/min
print(len(subs))
print(type(subs))
print(dir(subs))
print(sorted(subs["Subscribers gained"])) #isko use karne ke liye mere ko 
                                           #column ka naam btana padega 
print(max(subs["Subscribers gained"]))
print(min(subs["Subscribers gained"]))

365
<class 'pandas.core.frame.DataFrame'>
['T', '_AXIS_LEN', '_AXIS_ORDERS', '_AXIS_TO_AXIS_NUMBER', '_HANDLED_TYPES', '__abs__', '__add__', '__and__', '__annotations__', '__array__', '__array_priority__', '__array_ufunc__', '__arrow_c_stream__', '__bool__', '__class__', '__contains__', '__copy__', '__dataframe__', '__dataframe_consortium_standard__', '__deepcopy__', '__delattr__', '__delitem__', '__dict__', '__dir__', '__divmod__', '__doc__', '__eq__', '__finalize__', '__floordiv__', '__format__', '__ge__', '__getattr__', '__getattribute__', '__getitem__', '__getstate__', '__gt__', '__hash__', '__iadd__', '__iand__', '__ifloordiv__', '__imod__', '__imul__', '__init__', '__init_subclass__', '__invert__', '__ior__', '__ipow__', '__isub__', '__iter__', '__itruediv__', '__ixor__', '__le__', '__len__', '__lt__', '__matmul__', '__mod__', '__module__', '__mul__', '__ne__', '__neg__', '__new__', '__nonzero__', '__or__', '__pandas_priority__', '__pos__', '__pow__', '__radd__', '__rand__', '__rdivmod__', '__reduce__', '__reduce_ex__', '__repr__', '__rfloordiv__', '__rmatmul__', '__rmod__', '__rmul__', '__ror__', '__round__', '__rpow__', '__rsub__', '__rtruediv__', '__rxor__', '__setattr__', '__setitem__', '__setstate__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', '__truediv__', '__weakref__', '__xor__', '_accessors', '_accum_func', '_agg_examples_doc', '_agg_see_also_doc', '_align_for_op', '_align_frame', '_align_series', '_append', '_arith_method', '_arith_method_with_reindex', '_as_manager', '_attrs', '_box_col_values', '_can_fast_transpose', '_check_inplace_and_allows_duplicate_labels', '_check_is_chained_assignment_possible', '_check_label_or_level_ambiguity', '_check_setitem_copy', '_clear_item_cache', '_clip_with_one_bound', '_clip_with_scalar', '_cmp_method', '_combine_frame', '_consolidate', '_consolidate_inplace', '_construct_axes_dict', '_construct_result', '_constructor', '_constructor_from_mgr', '_constructor_sliced', '_constructor_sliced_from_mgr', '_create_data_for_split_and_tight_to_dict', '_data', '_deprecate_downcast', '_dir_additions', '_dir_deletions', '_dispatch_frame_op', '_drop_axis', '_drop_labels_or_levels', '_ensure_valid_index', '_find_valid_index', '_flags', '_flex_arith_method', '_flex_cmp_method', '_from_arrays', '_from_mgr', '_get_agg_axis', '_get_axis', '_get_axis_name', '_get_axis_number', '_get_axis_resolvers', '_get_block_manager_axis', '_get_bool_data', '_get_cleaned_column_resolvers', '_get_column_array', '_get_index_resolvers', '_get_item_cache', '_get_label_or_level_values', '_get_numeric_data', '_get_value', '_get_values_for_csv', '_getitem_bool_array', '_getitem_multilevel', '_getitem_nocopy', '_getitem_slice', '_gotitem', '_hidden_attrs', '_indexed_same', '_info_axis', '_info_axis_name', '_info_axis_number', '_info_repr', '_init_mgr', '_inplace_method', '_internal_names', '_internal_names_set', '_is_copy', '_is_homogeneous_type', '_is_label_or_level_reference', '_is_label_reference', '_is_level_reference', '_is_mixed_type', '_is_view', '_is_view_after_cow_rules', '_iset_item', '_iset_item_mgr', '_iset_not_inplace', '_item_cache', '_iter_column_arrays', '_ixs', '_logical_func', '_logical_method', '_maybe_align_series_as_frame', '_maybe_cache_changed', '_maybe_update_cacher', '_metadata', '_mgr', '_min_count_stat_function', '_needs_reindex_multi', '_pad_or_backfill', '_protect_consolidate', '_reduce', '_reduce_axis1', '_reindex_axes', '_reindex_multi', '_reindex_with_indexers', '_rename', '_replace_columnwise', '_repr_data_resource_', '_repr_fits_horizontal_', '_repr_fits_vertical_', '_repr_html_', '_repr_latex_', '_reset_cache', '_reset_cacher', '_sanitize_column', '_series', '_set_axis', '_set_axis_name', '_set_axis_nocheck', '_set_is_copy', '_set_item', '_set_item_frame_value', '_set_item_mgr', '_set_value', '_setitem_array', '_setitem_frame', '_setitem_slice', '_shift_with_freq', '_should_reindex_frame_op', '_slice', '_stat_function', '_stat_function_ddof', '_take_with_is_copy', '_to_dict_of_blocks', '_to_latex_via_styler', '_typ', '_update_inplace', '_validate_dtype', '_values', '_where', 'abs', 'add', 'add_prefix', 'add_suffix', 'agg', 'aggregate', 'align', 'all', 'any', 'apply', 'applymap', 'asfreq', 'asof', 'assign', 'astype', 'at', 'at_time', 'attrs', 'axes', 'backfill', 'between_time', 'bfill', 'bool', 'boxplot', 'clip', 'columns', 'combine', 'combine_first', 'compare', 'convert_dtypes', 'copy', 'corr', 'corrwith', 'count', 'cov', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'div', 'divide', 'dot', 'drop', 'drop_duplicates', 'droplevel', 'dropna', 'dtypes', 'duplicated', 'empty', 'eq', 'equals', 'eval', 'ewm', 'expanding', 'explode', 'ffill', 'fillna', 'filter', 'first', 'first_valid_index', 'flags', 'floordiv', 'from_dict', 'from_records', 'ge', 'get', 'groupby', 'gt', 'head', 'hist', 'iat', 'idxmax', 'idxmin', 'iloc', 'index', 'infer_objects', 'info', 'insert', 'interpolate', 'isetitem', 'isin', 'isna', 'isnull', 'items', 'iterrows', 'itertuples', 'join', 'keys', 'kurt', 'kurtosis', 'last', 'last_valid_index', 'le', 'loc', 'lt', 'map', 'mask', 'max', 'mean', 'median', 'melt', 'memory_usage', 'merge', 'min', 'mod', 'mode', 'mul', 'multiply', 'ndim', 'ne', 'nlargest', 'notna', 'notnull', 'nsmallest', 'nunique', 'pad', 'pct_change', 'pipe', 'pivot', 'pivot_table', 'plot', 'pop', 'pow', 'prod', 'product', 'quantile', 'query', 'radd', 'rank', 'rdiv', 'reindex', 'reindex_like', 'rename', 'rename_axis', 'reorder_levels', 'replace', 'resample', 'reset_index', 'rfloordiv', 'rmod', 'rmul', 'rolling', 'round', 'rpow', 'rsub', 'rtruediv', 'sample', 'select_dtypes', 'sem', 'set_axis', 'set_flags', 'set_index', 'shape', 'shift', 'size', 'skew', 'sort_index', 'sort_values', 'squeeze', 'stack', 'std', 'style', 'sub', 'subtract', 'sum', 'swapaxes', 'swaplevel', 'tail', 'take', 'to_clipboard', 'to_csv', 'to_dict', 'to_excel', 'to_feather', 'to_gbq', 'to_hdf', 'to_html', 'to_json', 'to_latex', 'to_markdown', 'to_numpy', 'to_orc', 'to_parquet', 'to_period', 'to_pickle', 'to_records', 'to_sql', 'to_stata', 'to_string', 'to_timestamp', 'to_xarray', 'to_xml', 'transform', 'transpose', 'truediv', 'truncate', 'tz_convert', 'tz_localize', 'unstack', 'update', 'value_counts', 'values', 'var', 'where', 'xs']
[33, 33, 35, 37, 39, 40, 40, 40, 40, 42, 42, 43, 44, 44, 44, 45, 46, 46, 48, 49, 49, 49, 49, 50, 50, 50, 51, 54, 56, 56, 56, 56, 57, 61, 62, 64, 65, 65, 66, 66, 66, 66, 67, 68, 70, 70, 70, 71, 71, 72, 72, 72, 72, 72, 73, 74, 74, 75, 76, 76, 76, 76, 77, 77, 78, 78, 78, 79, 79, 80, 80, 80, 81, 81, 82, 82, 83, 83, 83, 84, 84, 84, 85, 86, 86, 86, 87, 87, 87, 87, 88, 88, 88, 88, 88, 89, 89, 89, 90, 90, 90, 90, 91, 92, 92, 92, 93, 93, 93, 93, 95, 95, 96, 96, 96, 96, 97, 97, 98, 98, 99, 99, 100, 100, 100, 101, 101, 101, 102, 102, 103, 103, 104, 104, 104, 105, 105, 105, 105, 105, 105, 105, 105, 105, 108, 108, 108, 108, 108, 108, 109, 109, 110, 110, 110, 111, 111, 112, 113, 113, 113, 114, 114, 114, 114, 115, 115, 115, 115, 117, 117, 117, 118, 118, 119, 119, 119, 119, 120, 122, 123, 123, 123, 123, 123, 124, 125, 126, 127, 128, 128, 129, 130, 131, 131, 132, 132, 134, 134, 134, 135, 135, 136, 136, 136, 137, 138, 138, 138, 139, 140, 144, 145, 146, 146, 146, 146, 147, 149, 150, 150, 150, 150, 151, 152, 152, 152, 153, 153, 153, 154, 154, 154, 155, 155, 156, 156, 156, 156, 157, 157, 157, 157, 158, 158, 159, 159, 160, 160, 160, 160, 162, 164, 166, 167, 167, 168, 170, 170, 170, 170, 171, 172, 172, 173, 173, 173, 174, 174, 175, 175, 176, 176, 177, 178, 179, 179, 180, 180, 180, 182, 183, 183, 183, 184, 184, 184, 185, 185, 185, 185, 186, 186, 186, 188, 189, 190, 190, 192, 192, 192, 196, 196, 196, 197, 197, 202, 202, 202, 203, 204, 206, 207, 209, 210, 210, 211, 212, 213, 214, 216, 219, 220, 221, 221, 222, 222, 224, 225, 225, 226, 227, 228, 229, 230, 231, 233, 236, 236, 237, 241, 243, 244, 245, 247, 249, 254, 254, 258, 259, 259, 261, 261, 265, 267, 268, 269, 276, 276, 290, 295, 301, 306, 312, 396]
396
33

In [337]:
# type conversion
list(marks_series)
dict(marks_series)
set(marks_series)

{34, 43, 49, 54}

In [354]:
# membership operator
bolly
'2 States (2014 film)' in bolly

False

In [363]:
# looping
# Jab tum for i in bolly: likhte ho, to pandas.DataFrame me default iteration columns par hoti hai.
# Isliye tumhe sirf column names print milenge.

for i in bolly:
    print(i)

lead

In [ ]:
# Arithmetic Operators

In [ ]:
# Relational Operators